#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура НачатьВыполнение(Команда)
	
	ЭтаФорма.РезультатВыполнения = "";
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("НачалоПериода", Период.ДатаНачала);
	ПараметрыЗапуска.Вставить("КонецПериода",Период.ДатаОкончания);
	ПараметрыЗапуска.Вставить("ДополнительныеПараметры",ДополнительныеПараметры());
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	ИДЗадания 	= СтруктураФоновогоЗадания.ИдентификаторЗадания;
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал 	= 2;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект), ПараметрыОжидания);
	
КонецПроцедуры
#КонецОбласти  

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт

	ЭтаФорма.РезультатВыполнения = Результат.Статус;
	
КонецПроцедуры  

&НаСервере
Функция ДополнительныеПараметры()
	
	Возврат Обработки.ВыполнитьПроцедуру.НовыеДополнительныеПараметрыВыполнения();
	
КонецФункции	
	
&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Обработка документов в фоновом режиме";
	ВыполняемыйМетод = "Обработка.ВыполнитьПроцедуру.МодульОбъекта.ОбработкаПроведенияДокументовВФоновомРежиме";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ВыполняемыйМетод, ПараметрыЗапуска.НачалоПериода, ПараметрыЗапуска.КонецПериода, ПараметрыЗапуска.ДополнительныеПараметры); 
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции   
#КонецОбласти  

