
Процедура ОбработкаПроведенияДокументовВФоновомРежиме(НачалоПериода,КонецПериода,ДополнительныеПараметры) Экспорт
	ИмитироватьДлительноеДействие(ДополнительныеПараметры);	
КонецПроцедуры	

Процедура ИмитироватьДлительноеДействие(ДополнительныеПараметры)
	
	Если ДополнительныеПараметры.ДлительностьРасчета = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 выполнена на %2 %'"),
		ТекущаяДатаСеанса(), 100, 0);
		
		Если ДополнительныеПараметры.СообщенияЧерезСообщить Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	РазмерШаговПрогресса = Новый Массив;
	ОстатокДлительности = ДополнительныеПараметры.ДлительностьРасчета;
	УказанныйРазмерШаговПрогресса = СтрРазделить(ДополнительныеПараметры.РазмерШаговПрогресса, " ", Ложь);
	Для Каждого РазмерШага Из УказанныйРазмерШаговПрогресса Цикл
		ЧислоСекунд = Число(РазмерШага);
		Если ЧислоСекунд > ДополнительныеПараметры.ДлительностьРасчета Тогда
			ЧислоСекунд = ДополнительныеПараметры.ДлительностьРасчета;
		КонецЕсли;
		Если ОстатокДлительности < ЧислоСекунд Тогда
			ЧислоСекунд = ОстатокДлительности;
		КонецЕсли;
		РазмерШаговПрогресса.Добавить(ЧислоСекунд * 1000);
		ОстатокДлительности = ОстатокДлительности - ЧислоСекунд;
		Если ОстатокДлительности = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоШаговПрогресса = ДополнительныеПараметры.КоличествоШаговПрогресса;
	РазмерНеуказанногоШага = ОстатокДлительности / КоличествоШаговПрогресса * 1000;
	ФоновоеЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Для Счетчик = 1 По КоличествоШаговПрогресса Цикл
		Процент = Цел(Счетчик / КоличествоШаговПрогресса * 100);
		Этап = Мин(Цел(Счетчик / (КоличествоШаговПрогресса / 3)) + 1, 3); // Имитация операции в 3 этапа.
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 операция  на %2 % (этап %3)'"),
		ТекущаяДатаСеанса(), Процент, Этап);
		
		Если ДополнительныеПараметры.СообщенияЧерезСообщить Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		РазмерТекущегоШага = ?(РазмерШаговПрогресса.Количество() < Счетчик,
		РазмерНеуказанногоШага, РазмерШаговПрогресса[Счетчик - 1]);
		
		Если ДополнительныеПараметры.ВыводитьПрогрессВыполнения Тогда
			ДлительныеОперации.СообщитьПрогресс(Процент, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Этап %1, Шаг %2'"), Этап, Строка(Счетчик) + "[" + РазмерТекущегоШага / 1000 + "]"));
		КонецЕсли;
		
		Начало = Начало + РазмерТекущегоШага;
		ТекущийМомент = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ИнтервалОжидания = (Начало - ТекущийМомент) / 1000;
		Если ИнтервалОжидания > 0 Тогда
			Пауза(ФоновоеЗадание, ИнтервалОжидания);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Пауза(ФоновоеЗадание, ИнтервалОжидания)
	
	Если ФоновоеЗадание <> Неопределено Тогда
		ФоновоеЗадание.ОжидатьЗавершенияВыполнения(ИнтервалОжидания);
	Иначе
		Конец = ТекущаяУниверсальнаяДатаВМиллисекундах() + ИнтервалОжидания * 1000;
		Пока ТекущаяУниверсальнаяДатаВМиллисекундах() < Конец Цикл
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

